Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Matching is always done on the "longest path wins" basis. Less specific permission sets are not considered if a more specific one has been matched:
ja_jp: マッチングは常に「最長パスが優先される」という基準で行われます。 具体的な権限セットがマッチした場合、それよりも具体性に欠ける権限セットは考慮されません。

source: Matching multiple paths and methods: both win
ja_jp: 複数のパスのマッチング:一番長いパスが勝ちます

source: Matching multiple paths: longest path wins
ja_jp: 複数のパスのマッチング:一番長いパスが勝ちます。

source: Matching multiple paths: most specific method wins
ja_jp: 複数のパスのマッチング:一番具体的なパスが勝ちます

source: Matching multiple sub-paths: longest path to the `*` wildcard wins
ja_jp: 複数のサブパスのマッチング: `*` ワイルドカードへの最長パスが優先される

source: Matching on paths and methods
ja_jp: パスとメソッドのマッチング

source: Matching on paths, methods
ja_jp: パス、メソッドでのマッチング

source: Matching path but not method
ja_jp: パスはマッチするがメソッドはマッチしない場合

source: Mathematically speaking, school timetabling is an _NP-hard_ problem. This means it is difficult to scale. Simply brute force iterating through all possible combinations takes millions of years for a non-trivial dataset, even on a supercomputer. Luckily, AI constraint solvers such as OptaPlanner have advanced algorithms that deliver a near-optimal solution in a reasonable amount of time.
ja_jp: 数学的に言えば、学校の時間割は _NP-hard_ な問題です。これは、スケーリングが難しいことを意味します。考えられるすべての組み合わせを総当たり攻撃で繰り返すだけでは、スーパーコンピューターであっても重要なデータセットだけで数百万年かかります。幸い、OptaPlanner などの AI 制約ソルバーには、妥当な時間内に最適に近いソリューションを提供できる高度なアルゴリズムがあります。

source: Matrix parameter
ja_jp: マトリックスパラメーター

source: Maturity status that could be `stable`, `preview`, `experimental`. It is up to extension maintainers to evaluate the maturity status and communicate it to the users
ja_jp: 成熟度ステータス (`stable`、 `preview`、 `experimental`)。成熟度ステータスを判断してユーザーに周知するかどうかは、エクステンションのメンテナーが決定します

source: Maven 3.9 brought some breaking changes, and the integration with Quarkus was not working properly. It is now fixed and you can use Maven 3.9 to build your Quarkus 3 applications.
ja_jp: Maven 3.9では、いくつかの変更点があり、Quarkusとの統合が正しく動作していませんでした。現在は修正されており、Maven 3.9を使用してQuarkus 3アプリケーションをビルドすることができます。

source: Maven 3.9 came with some breaking changes and the integration with Quarkus was not working properly. It is now fixed and you can use Maven 3.9 to build your Quarkus 3.0.0.CR1 applications.
ja_jp: Maven 3.9では、いくつかの変更点があり、Quarkusとの統合が正しく動作していませんでした。現在は修正されており、Maven 3.9を使用してQuarkus 3.0.0.CR1アプリケーションをビルドすることが可能です。

source: Maven 3.9 is now required to build Quarkus applications.
ja_jp: Quarkusアプリケーションをビルドするには、Maven 3.9が必須になりました。

source: Maven 3.9 required
ja_jp: Maven 3.9が必須

source: Maven Dependencies
ja_jp: Maven 依存関係

source: Maven Dependency SBOMs
ja_jp: Maven 依存関係 SBOM

source: Maven configuration
ja_jp: Maven の設定

source: Maven creating production application
ja_jp: Maven による本番アプリケーションの作成

source: Maven default value: `target/generated-sources/grpc`
ja_jp: Maven のデフォルト値: `target/generated-sources/grpc`

source: Maven dev mode
ja_jp: Maven の開発モード

source: Maven goals reference
ja_jp: Mavenゴールリファレンス

source: Maven has generated a `greeting-extension` directory containing the extension project which consists of the parent `pom.xml`, the `runtime` and the `deployment` modules.
ja_jp: Maven は、親 `pom.xml`、 `runtime` 、 `deployment` モジュールから成る拡張プロジェクトを含む `quarkus-greeting` ディレクトリーを生成しました。

source: Maven has generated a `greeting-extension` directory containing the extension project, which consists of the parent `pom.xml`, the `runtime`, and the `deployment` modules.
ja_jp: Maven は、親 `pom.xml`、 `runtime` モジュール、 `deployment` モジュールで構成されるエクステンションプロジェクトを含む `greeting-extension` ディレクトリーを生成しました。

source: Maven projects could add the following goal to their `quarkus-maven-plugin` configuration:
ja_jp: Maven プロジェクトでは、 `quarkus-maven-plugin` 設定に次のゴールを追加できます。

source: Maven repository
ja_jp: Mavenリポジトリ

source: Maven repository configuration
ja_jp: Mavenリポジトリの設定

source: Maven repository mirrors and proxies
ja_jp: Mavenリポジトリのミラーとプロキシ

source: Maven setup
ja_jp: Maven のセットアップ

source: Maven test plugin configuration
ja_jp: Mavenテストプラグインの設定

source: Maven test plugins (such as `surefire` and `failsafe`), for example, are not propagating build system properties to the running tests by default. Which means some of the system properties set by the Maven CLI aren't available for the Quarkus Maven resolver initialized for the tests, which may result in test dependencies being resolved using different settings than the main Maven build.
ja_jp: たとえば、Maven テストプラグイン (`surefire` や `failsafe` など) は、デフォルトでは、ビルドシステムのプロパティーを実行中のテストに伝搬しません。つまり、MavenCLI によって設定されたシステムプロパティーの一部は、テスト用に初期化された Quarkus Maven リゾルバーでは使用できないため、メインの Maven ビルドとは異なる設定を使用して、テストの依存関係が解決される可能性があります。

source: Maven test plugins (such as `surefire` and `failsafe`), for example, are not propagating build system properties to the running tests by default. Which means some system properties set by the Maven CLI aren't available for the Quarkus Maven resolver initialized for the tests, which may result in test dependencies being resolved using different settings than the main Maven build.
ja_jp: たとえば、Maven テストプラグイン (`surefire` や `failsafe` など) は、デフォルトでは、ビルドシステムのプロパティーを実行中のテストに伝搬しません。つまり、MavenCLI によって設定されたシステムプロパティーの一部は、テスト用に初期化された Quarkus Maven リゾルバーでは使用できないため、メインの Maven ビルドとは異なる設定を使用して、テストの依存関係が解決される可能性があります。

source: Maven user settings
ja_jp: Mavenユーザー設定

source: Maven's `sourceDirectory` and `testSourceDirectory` build properties are configured to point to Kotlin sources (`src/main/kotlin` and `src/test/kotlin` respectively)
ja_jp: Maven の `sourceDirectory` と `testSourceDirectory` ビルドプロパティーは、Kotlin ソースを指すように設定されています (それぞれ `src/main/kotlin` と `src/test/kotlin` )。

source: Max backoff interval (in nanosecond).
ja_jp: 最大バックオフ間隔（ナノ秒）。

source: Maximum duration for completing a request.
ja_jp: リクエスト完了までの最長時間。

source: Maximum number of allowed HTTP parameters. Provides protection against parameter-based DoS attacks.
ja_jp: 許可される HTTP パラメーターの最大数。パラメーターベースの DoS 攻撃に対する保護を提供します。

source: Maximum number of lookup requests allowed on each broker connection to prevent overloading a broker.
ja_jp: ブローカーへの過負荷を防ぐため、各ブローカー接続で許可されるルックアップ要求の最大数。

source: Maximum number of rejected requests of a broker in a certain time frame (60 seconds) after the current connection is closed and the client creating a new connection to connect to a different broker.
ja_jp: 現在の接続が閉じられ、クライアントが別のブローカーに接続するために新しい接続を作成した後、一定時間内（60秒）にブローカーが拒否したリクエストの最大数。

source: Maximum number of times that a message will be redelivered before being sent to the dead letter topic
ja_jp: デッドレター・トピックに送信される前にメッセージが再配信される最大回数。

source: Maximum read time of a request.
ja_jp: リクエストの最大読み取り時間。

source: Maximum times of redirected lookup requests.
ja_jp: リダイレクトされたルックアップ要求の最大回数。

source: Maybe we could use it to get rid of the class loading noise and get a clearer picture of what's really going on during startup?
ja_jp: Project Leyden を使ってクラスロードのノイズを取り除けば、起動中に実際に何が起きているのかをより明確に把握できるのではないかと考えたのです。

source: Meaning
ja_jp: 意味

source: Measure durations with Timers
ja_jp: タイマーで時間を計測する

source: Measure of max obtainable memory
ja_jp: 取得可能な最大メモリーの測定値

source: Measure of memory committed
ja_jp: コミットされたメモリーの測定値

source: Measure of memory used
ja_jp: 使用済みメモリーの測定値

source: Measure of memory used, as measured after the most recent garbage collection event on this pool.
ja_jp: このプールでの最新のガベージコレクションイベント後に測定された、使用済みメモリーの測定値。

source: Measurements should be measuring the performance of the frameworks, rather than supporting infrastructure like the database. In practice this means we want the experimental setup to be CPU-bound.
ja_jp: 測定は、データベースのようなサポートインフラストラクチャではなく、フレームワークのパフォーマンスを測定するものであるべきです。実際には、これは実験セットアップがCPUバウンドであることを意味します。

source: Measuring Memory Correctly on Docker
ja_jp: Docker上でメモリを正しく測定する

source: Measuring Performance
ja_jp: パフォーマンスの測定

source: Measuring Success
ja_jp: 効果測定

source: Measuring the coverage of your Integration Tests
ja_jp: 統合テストのカバレッジを測定する

source: Measuring the coverage of your Unit Tests
ja_jp: ユニットテストのカバレッジを測定する

source: Measuring the coverage of your tests
ja_jp: テストカバレッジの測定

source: Meet Quarkiverse!
ja_jp: Quarkiverse と会いましょう!

source: Member variable using the `@Inject` annotation
ja_jp: `@Inject` アノテーションを使用したメンバー変数

source: Memory
ja_jp: メモリ

source: Memory Categories in Netty
ja_jp: Nettyにおけるメモリカテゴリー

source: Memory Management Options
ja_jp: メモリ管理オプション

source: Memory footprint
ja_jp: メモリフットプリント

source: Memory icon
ja_jp: メモリのアイコン

source: Memory management for Quarkus native executables is enabled by GraalVM’s SubstrateVM runtime system.
ja_jp: Quarkus ネイティブ実行可能ファイルのメモリー管理は、GraalVM の SubstrateVM ランタイムシステムによって有効になります。

source: Memory management for Quarkus native executables is enabled by GraalVM’s SubstrateVM runtime system. The memory management component in GraalVM is explained in detail link:https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/optimizations-and-performance/MemoryManagement[here]. This guide complements the information available in the GraalVM website with further observations particularly relevant to Quarkus applications.
ja_jp: Quarkusネイティブ実行可能ファイルのメモリ管理は、GraalVMのSubstrateVMランタイムシステムによって実現されています。GraalVMのメモリ管理コンポーネントは、 link:https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/optimizations-and-performance/MemoryManagement[ここ] で詳しく説明されています。このガイドでは、GraalVMのウェブサイトで利用可能な情報を補完し、特にQuarkusアプリケーションに関連するさらなる見解を示しています。

source: MemorySize link:#memory-size-note-anchor[icon:question-circle[], title=More information about the MemorySize format]
ja_jp: MemorySize link:#memory-size-note-anchor[icon:question-circle[], title=MemorySizeフォーマットについての詳細情報]

source: Mentioned in the previous sections was the concept of `deployment-target`. This concept allows users to control which Kubernetes manifests will be generated and deployed to a cluster (if `quarkus.kubernetes.deploy` has been set to `true`).
ja_jp: 前のセクションで述べたのは `deployment-target` という概念です。この概念により、ユーザーはどの Kubernetes マニフェストを生成してクラスターにデプロイするかを制御することができます ( `quarkus.kubernetes.deploy` が `true` に設定されている場合)。

source: Menu
ja_jp: メニュー

source: Menu (Left Sidebar)
ja_jp: メニュー (左サイドバー)

source: Menu Item
ja_jp: メニュー項目

source: Merging Quarkus Platform Properties
ja_jp: Quarkusプラットフォームプロパティのマージ

source: Message Body Based on Qute Templates
ja_jp: Quteテンプレートに基づくメッセージ Body

source: Message Bundle Interface Example
ja_jp: メッセージバンドルインターフェイスの例

source: Message Schemas in Pulsar
ja_jp: Pulsar のメッセージスキーマ

source: Message Templates
ja_jp: メッセージテンプレート

source: Message bundle files must be encoded in UTF-8. The file name consists of the relevant bundle name (e.g. `msg`) and underscore followed by the locate tag (IETF). The file format is very simple: each line represents either a key/value pair with the equals sign used as a separator or a comment (line starts with `#`). Blank lines are ignored. Keys are _mapped to method names_ from the corresponding message bundle interface. Values represent the templates normally defined by `io.quarkus.qute.i18n.Message#value()`. A value may be spread out across several adjacent normal lines. In such case, the line terminator must be escaped with a backslash character `\`. The behavior is very similar to the behavior of the `java.util.Properties.load(Reader)` method.
ja_jp: メッセージバンドルファイルはUTF-8でエンコードされていなければなりません。 ファイル名は、関連するバンドル名(例: `msg` )とアンダースコア、そしてlocateタグ(IETF)で構成されます。 ファイル形式は非常にシンプルで、各行はキーと値のペアを表し、等号がセパレータとして使われるか、コメント(行頭は `#` )が使われます。 空行は無視されます。 キーは、対応するメッセージ・バンドル・インターフェースの _メソッド名にマッピング_ されます。 値は通常 `io.quarkus.qute.i18n.Message#value()` で定義されているテンプレートを表します。 値は、隣接する複数の行にまたがっていてもかまいません。 その場合、行の終端をバックスラッシュ文字 `\` でエスケープする必要があります。 動作は `java.util.Properties.load(Reader)` メソッドの動作に非常に似ています。

source: Message bundle files must be encoded in _UTF-8_. The file name consists of the relevant bundle name (e.g. `msg`) and underscore followed by a language tag (IETF; e.g. `en-US`). The language tag may be omitted, in which case the language tag of the default bundle locale is used. For example, if bundle `msg` has default locale `en`, then `msg.properties` is going to be treated as `msg_en.properties`.
ja_jp: メッセージバンドルファイルは _UTF-8_ でエンコードされている必要があります。ファイル名は、関連するバンドル名 (例: `msg`) とアンダースコア、続いて言語タグ (IETF; 例: `en-US`) で構成されます。言語タグは省略でき、その場合、デフォルトのバンドルロケールの言語タグが使用されます。例えば、バンドル `msg` のデフォルトロケールが `en` の場合、`msg.properties` は `msg_en.properties` として扱われます。

source: Message bundle files must be encoded in _UTF-8_. The file name consists of the relevant bundle name (e.g. `msg`) and underscore followed by a language tag (IETF; e.g. `en-US`). The language tag may be omitted, in which case the language tag of the default bundle locale is used. For example, if bundle `msg` has default locale `en`, then `msg.properties` is going to be treated as `msg_en.properties`. If both `msg.properties` and `msg_en.properties` are detected, an exception is thrown and build fails. The file format is very simple: each line represents either a key/value pair with the equals sign used as a separator or a comment (line starts with `#`). Blank lines are ignored. Keys are _mapped to method names_ from the corresponding message bundle interface. Values represent the templates normally defined by `io.quarkus.qute.i18n.Message#value()`. A value may be spread out across several adjacent normal lines. In such case, the line terminator must be escaped with a backslash character `\`. The behavior is very similar to the behavior of the `java.util.Properties.load(Reader)` method.
ja_jp: メッセージバンドルファイルは _UTF-8_ でエンコードされていなければなりません。 ファイル名は、関連するバンドル名 (例: `msg`) とアンダースコアで構成され、その後に言語タグ (IETF、たとえば `en-US`) が続きます。 言語タグは省略できます。その場合、デフォルトのバンドルロケールの言語タグが使用されます。 たとえば、バンドル `msg` のデフォルトロケールが `en` の場合、 `msg.properties` は `msg_en.properties` として扱われます。 `msg.properties` と `msg_en.properties` の両方が検出されると、例外がスローされ、ビルドは失敗します。 ファイル形式は非常にシンプルで、各行はキーと値のペア (等号を区切り文字として使用) またはコメント (行頭は `#`) を表します。 空行は無視されます。 キーは、対応するメッセージバンドルインターフェースから _メソッド名にマッピング_ されます。 値は、通常 `io.quarkus.qute.i18n.Message#value()` で定義されるテンプレートを表します。 値は、隣接する複数の通常行をまたぐことがあります。 その場合、行の終端をバックスラッシュ文字 `\` でエスケープする必要があります。 動作は `java.util.Properties.load(Reader)` メソッドの動作によく似ています。

source: Message bundle files must be encoded in _UTF-8_. The file name consists of the relevant bundle name (e.g. `msg`) and underscore followed by the locate tag (IETF). The file format is very simple: each line represents either a key/value pair with the equals sign used as a separator or a comment (line starts with `#`). Blank lines are ignored. Keys are _mapped to method names_ from the corresponding message bundle interface. Values represent the templates normally defined by `io.quarkus.qute.i18n.Message#value()`. A value may be spread out across several adjacent normal lines. In such case, the line terminator must be escaped with a backslash character `\`. The behavior is very similar to the behavior of the `java.util.Properties.load(Reader)` method.
ja_jp: メッセージバンドルファイルは、_UTF-8_ でエンコードされている必要があります。ファイル名は、関連するバンドル名 (例: `msg` ) とアンダースコア、続いてロケートタグ (IETF) で構成されます。ファイルフォーマットは非常にシンプルで、各行は、セパレーターとして等号が使われるキーと値のペアか、コメント (行頭は `#`) を表しています。空白行は無視されます。キーは対応するメッセージバンドルインターフェイスから _mapped to method names_ されます。値は通常、 `io.quarkus.qute.i18n.Message#value()` によって定義されるテンプレートを表します。値は、隣接する複数の通常行にまたがっていることがあります。その場合、行の終端をバックスラッシュ文字 `\` でエスケープしなければなりません。この挙動は `java.util.Properties.load(Reader)` メソッドの挙動に非常に似ています。

source: Message data compression type used by a producer. + Available options: + * https://github.com/lz4/lz4[LZ4] + * https://zlib.net/[ZLIB] + * https://facebook.github.io/zstd/[ZSTD] + * https://google.github.io/snappy/[SNAPPY]
ja_jp: プロデューサーが使用するメッセージデータ圧縮タイプ。+ 使用可能なオプション：+ * link:https://github.com/lz4/lz4[LZ4] + * link:https://zlib.net/[ZLIB] + * link:https://facebook.github.io/zstd/[ZSTD] + * link:https://google.github.io/snappy/[SNAPPY]

source: Message keys are used directly in templates. The bundle name is used as a namespace in template expressions. The `@MessageBundle` can be used to define the default strategy used to generate message keys from method names. However, the `@Message` can override this strategy and even define a custom key. By default, the annotated element's name is used as-is. Other possibilities are:
ja_jp: メッセージキーはテンプレート内で直接使用されます。 バンドル名はテンプレート式の名前空間として使用されます。 `@MessageBundle` は、メソッド名からメッセージキーを生成するために使用するデフォルトストラテジーを定義するために使用できます。 ただし、`@Message` はこのストラテジーをオーバーライドし、カスタムキーを定義することもできます。 デフォルトでは、アノテーションされた要素の名前がそのまま使用されます。 他の可能性としては、以下のようなものがあります。

source: Message keys for enum constants
ja_jp: 列挙定数のメッセージキー

source: Message processing may not happen synchronously and sequentially. When a Reactive Messaging `Message` processing completes, it acknowledges the message. In the case of processing failures, it sends a negative acknowledgment. The Kafka connector receives these acknowledgments and can decide what needs to be done, basically: to commit or not to commit.
ja_jp: メッセージ処理は、同期的・逐次的に行われるとは限りません。リアクティブメッセージング `Message` 処理が完了すると、メッセージを確認します。処理に失敗した場合は、否定的な確認応答を送信します。Kafka コネクタはこれらの確認応答を受信して、コミットするかしないかを決定します。

source: Message processing using virtual threads
ja_jp: 仮想スレッドを用いたメッセージ処理

source: Message routing logic for producers on https://pulsar.apache.org/docs/concepts-architecture-overview#partitioned-topics[partitioned topics]. + Apply the logic only when setting no key on messages. + Available options are as follows: + * `pulsar.RoundRobinDistribution`: round robin + * `pulsar.UseSinglePartition`: publish all messages to a single partition + * `pulsar.CustomPartition`: a custom partitioning scheme
ja_jp: link:https://pulsar.apache.org/docs/concepts-architecture-overview#partitioned-topics[パーティショニングされたトピック] 上のプロデューサに対するメッセージ・ルーティング・ロジック。 メッセージにキーを設定しない場合にのみ、このロジックを適用します。 使用可能なオプションは以下のとおりです： * `pulsar.RoundRobinDistribution` : ラウンドロビン+ * `pulsar.UseSinglePartition` : すべてのメッセージを単一のパーティションにパブリッシュします+ * `pulsar.CustomPartition` : カスタムパーティショニングスキーム

source: Message send timeout in ms. + If a message is not acknowledged by a server before the `sendTimeout` expires, an error occurs.
ja_jp: ミリ秒単位のメッセージ送信のタイムアウト。 `sendTimeout` が切れる前にメッセージがサーバによって確認されないと、エラーが発生します。

source: Message serialization in Kafka
ja_jp: Kafka でのメッセージのシリアライズ

source: Message templates are validated during the build. If a missing message template is detected, an exception is thrown and build fails.
ja_jp: メッセージテンプレートはビルド時に検証されます。メッセージテンプレートの欠落が検出された場合、例外がスローされ、ビルドに失敗します。

source: Messages and Metadata
ja_jp: メッセージとメタデータ

source: Messages coming from AMQP contain an instance of `IncomingAmqpMetadata` in the metadata.
ja_jp: AMQP からのメッセージには、メタデータに `IncomingAmqpMetadata` のインスタンスが含まれています。

source: Messages coming from RabbitMQ contain an instance of `IncomingRabbitMQMetadata` in the metadata.
ja_jp: RabbitMQ からのメッセージには、メタデータに `IncomingRabbitMQMetadata` のインスタンスが含まれています。

source: Messages that convey extra information regarding lifecycle or non-request-bound events which may be helpful for debugging.
ja_jp: デバッグに役立つかもしれない、ライフサイクルまたは非リクエストバウンドイベントに関する余分な情報を伝えるメッセージ

source: Messages that convey extra information regarding lifecycle or non-request-bound events, useful for debugging.
ja_jp: デバッグに便利な、ライフサイクル関連のイベントやリクエストに紐づかないイベントに関する追加情報を伝えるメッセージ。

source: Messages that convey extra per-request debugging information that may be very high frequency.
ja_jp: リクエストごとのデバッグ情報を伝えるメッセージで、非常に高い頻度で送信される可能性があります

source: Messages transit on *channels*. Application components connect to channels to publish and consume messages. The Kafka connector maps _channels_ to Kafka _topics_.
ja_jp: メッセージは *チャネル* を通過します。アプリケーションコンポーネントはチャネルに接続して、メッセージを公開および消費します。Kafka コネクターは _チャネル_ を Kafka _トピック_ にマップします。

source: Messages transit on *channels*. Application components connect to channels to publish and consume messages. The Pulsar connector maps _channels_ to Pulsar _topics_.
ja_jp: メッセージは *チャネル* を通過します。アプリケーションコンポーネントは、チャネルに接続してメッセージを公開および消費します。Pulsar コネクターは、_チャネル_ を Pulsar _トピック_ にマッピングします。

source: Messaging
ja_jp: メッセージング

source: Metadata
ja_jp: メタデータ

source: Metadata Sources
ja_jp: メタデータソース

source: Metadata about the documents, such as lineage and other relevant information, is stored in a "Metadata Store".
ja_jp: 系譜やその他の関連情報など、ドキュメントに関するメタデータは「Metadata Store」に保存されます。

source: Metamodel accessor
ja_jp: メタモデルアクセサー

source: Meter names should use dots to separate segments, `a.name.like.this`. Micrometer applies naming conventions to convert registered meter names to match the expectations of backend monitoring systems.
ja_jp: メーター名では、ドットを使用してセグメントを区切る必要があります (例: `a.name.like.this`)。 Micrometer は命名規則を適用し、登録されたメーター名をバックエンドモニタリングシステムの期待に一致するように変換します。

source: Method
ja_jp: メソッド

source: Method 1: Enable it at runtime
ja_jp: 方法1：実行時に有効化

source: Method 2: Enable it at build time
ja_jp: 方法2：ビルド時に有効化

source: Method Parameter Support in Qute Templates
ja_jp: Quteテンプレートにおけるメソッドパラメータのサポート

source: Method Parameters
ja_jp: メソッドパラメーター

source: Method called when the application is starting
ja_jp: アプリケーションの起動時に呼び出されるメソッド

source: Method called when the application is terminating
ja_jp: アプリケーションの終了時に呼び出されるメソッド

source: Method names in camelCase map to kebab-case property names:
ja_jp: キャメルケースのメソッド名は、ケバブケースのプロパティ名にマッピングされます。

source: Method parameter injection (for build step methods only)
ja_jp: メソッドパラメータ・インジェクション（ビルドステップ・メソッドの場合のみ）

source: Method parameters
ja_jp: メソッドパラメーター

source: Method parameters can be annotated with the `io.opentelemetry.extension.annotations.SpanAttribute` annotation to indicate which method parameters should be part of the Trace.
ja_jp: メソッドパラメータには、 `io.opentelemetry.extension.annotations.SpanAttribute` アノテーションを付けて、どのメソッドパラメータが Trace の一部となるべきかを示すことができます。

source: Method parameters can be annotated with the `io.opentelemetry.instrumentation.annotations.SpanAttribute` annotation to indicate which method parameters should be part of the span. The parameter name can be customized as well.
ja_jp: メソッドのパラメーターに `io.opentelemetry.instrumentation.annotations.SpanAttribute` アノテーションを付与することで、 どのメソッドパラメーターが Span の一部となるべきかを示すことができます。また、パラメーター名はカスタマイズすることも可能です。

source: Method parameters of <<typesafe_templates,type-safe templates>> are automatically turned into parameter declarations.
ja_jp: <<typesafe_templates,type-safe templates>> のメソッドパラメーターは、自動的にパラメーター宣言に変換されます。

source: Method parameters of xref:typesafe_templates[type-safe templates] are automatically turned into parameter declarations.
ja_jp: xref:typesafe_templates[タイプセーフテンプレート] のメソッドパラメータは、自動的にパラメータ宣言になります。

source: Method receiving messages from the client are annotated with `@OnTextMessage` or `@OnBinaryMessage`.
ja_jp: クライアントからメッセージを受信するメソッドには、 `@OnTextMessage` または `@OnBinaryMessage` アノテーションが付けられます。

source: Method signature
ja_jp: メソッドシグネチャ

source: Method-level annotations override the class-level annotation. In this particular case, the name is not defaulted but selected explicitly.
ja_jp: メソッドレベルのアノテーションは、クラスレベルのアノテーションをオーバーライドします。この特別なケースでは、名前はデフォルトではなく、明示的に選択されます。

source: Method-level security annotation must be placed on the endpoint implementation.
ja_jp: メソッドレベルのセキュリティーアノテーションはエンドポイント実装に配置する必要があります。

source: Methods annotated with `@ClientExceptionMapper` can also take a `java.lang.reflect.Method` parameter which is useful if the exception mapping code needs to know the REST Client method that was invoked and caused the exception mapping code to engage.
ja_jp: `@ClientExceptionMapper` でアノテーションされたメソッドは、 `java.lang.reflect.Method` パラメーターを取れます。これは、例外対応のコードは、呼び出されて例外を発生したREST Client メソッドを知る場合に便利です。

source: Methods annotated with `@ConsumeEvent` can also be annotated with `@RunOnVirtualThread`. In this case, the method is invoked on a virtual thread. Each event is invoked on a different virtual thread.
ja_jp: `@ConsumeEvent` でアノテーションされたメソッドが `@RunOnVirtualThread` でもアノテーションされている場合、 メソッドは仮想スレッド上で呼び出されます。 各イベントは異なる仮想スレッド上で起動されます。

source: Methods annotated with `@NonBlocking` are considered non-blocking.
ja_jp: `@NonBlocking` アノテーションが付けられたメソッドは、ノンブロッキングとみなされます。
